Day5_commented.org
#+TITLE: Day 5 - Commented History from Class
#+AUTHOR: Cari Bogulski, Jason Gullifer
#+EMAIL: cari.bogulski@gmail.com, jason.gullifer@gmail.com
#+PROPERTY: results output
#+PROPERTY: session *R*
#+PROPERTY: exports both

* Analyzing Simon Data Continued
Today we continued analyzing Simon Data starting where Homework 4 left
off. We added absolute outlier marking, and fixed how we marked
relative outliers (marking them separately for correct and other
trials). We then summarized the data using =ddply= and learned about
how to use the =reshape= package to flexibly reshape data.

** Homework 4 Solution Script

You can download the Homework 4 solution file [[./Script Files/Homework_Set_4_solved.R][here]].

Below we've cut down the homework 4 script file a bit, leaving only
lines that manipulate and summarize the data. We removed calls to
e.g. =xtabs()=. 
#+begin_src R
# Load packages
library(plyr)
library(reshape)

# Load Data
data_unfiltered <- read.csv("Cari_Simon_Data.csv")

# Remove practice
data <- data_unfiltered[data_unfiltered$Running!="PracTrials",]

# Assign group names 
data$Group[data$Subject > 100 & data$Subject < 200] = "Monolinguals"
data$Group[data$Subject > 200 & data$Subject < 300] = "SpanEng_Bilinguals"
data$Group[data$Subject > 300 & data$Subject < 400] = "ChineseEng_Bilinguals"
data$Group[data$Subject > 400 & data$Subject < 500] = "EngSpan_Bilinguals"

# Remove the participant whose number fall outside of these windows
data = data[is.na(data$Group)==F,]


# Preserve Stimulus.ACC as a new variable in data called "original_acc".
# Make Stimulus.ACC a factor, labeling 0s as "incorrect" and 1s as
# "correct". Also add the relative outliers column.

data$original_acc = data$Stimulus.ACC
data$Stimulus.ACC = as.factor(data$Stimulus.ACC)
levels(data$Stimulus.ACC) = c("incorrect", "correct", "rel_outliers")

# Using ddply(), identify FROM THE CORRECT TRIALS ONLY the trials 
# that fall outside 2.5 standard deviations above and below the mean 
# for each subject. Make sure to only use correct trials in that mean! 
# Label these trials as "rel_outliers". Also use a fileorder vector to 
# keep track of the original order othe dataset.

data$FileOrder = seq(1,nrow(data))

data = ddply(data, .(Subject), transform, 
             high_cutoff = mean(Stimulus.RT) + 2.5*sd(Stimulus.RT),
             low_cutoff = mean(Stimulus.RT - 2.5*sd(Stimulus.RT)))

data$Stimulus.ACC[data$Stimulus.ACC=="correct" & 
                    (data$Stimulus.RT > data$high_cutoff | 
                       data$Stimulus.RT < data$low_cutoff)]="rel_outliers"

data = data[order(data$FileOrder),]

# Calculate mean RT and Accuracy (taken from original acc) 
# per Subject, per Group, and per condition (Congruency). For the mean RTs,
# take only those those trials that were correct. Create a dataframe 
# entitled "summary" that contains this information.

summary = ddply(data[data$Stimulus.ACC=="correct",], .(Subject, Group,
                Congruency), summarise, Mean.RT = mean(Stimulus.RT))

# Your advisor also wants to see the data additionally broken down by block. 

block_summary = ddply(data[data$Stimulus.ACC=="correct",], 
		.(Subject, Group, Congruency, Running), summarise,
		Mean.RT = mean(Stimulus.RT))
#+end_src

** Modifications to the Simon Script
