Day5_commented.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Day 5 - Commented History from Class</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Day 5 - Commented History from Class"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-19 15:12:44 EDT"/>
<meta name="author" content="Cari Bogulski, Jason Gullifer"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Day 5 - Commented History from Class</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Analyzing Simon Data Continued</a>
<ul>
<li><a href="#sec-1-1">1.1 Homework 4 Solution Script</a></li>
<li><a href="#sec-1-2">1.2 Modifications to the Simon Script</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Marking absolute outliers &amp; Relative Outliers</a></li>
<li><a href="#sec-1-2-2">1.2.2 Summarizing our Simon Data</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Final Script</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Analyzing Simon Data Continued</h2>
<div class="outline-text-2" id="text-1">

<p>Today we continued analyzing Simon Data starting where Homework 4 left
off. We added absolute outlier marking, and fixed how we marked
relative outliers (marking them separately for correct and other
trials). We then summarized the data using <code>ddply</code> and learned about
how to use the <code>reshape</code> package to flexibly reshape data.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Homework 4 Solution Script</h3>
<div class="outline-text-3" id="text-1-1">


<p>
You can download the Homework 4 solution file <a href="./Script Files/Homework_Set_4_solved.R">here</a>.
</p>
<p>
Below we've cut down the homework 4 script file a bit, leaving only
lines that manipulate and summarize the data. We removed calls to
e.g. <code>xtabs()</code>. 
</p>


<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Load packages</span>
<span style="color: #008b8b;">library</span>(plyr)
<span style="color: #008b8b;">library</span>(reshape)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Load Data</span>
data_unfiltered <span style="color: #008b8b;">&lt;-</span> read.csv(<span style="color: #8b2252;">"Cari_Simon_Data.csv"</span>)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Remove practice</span>
data <span style="color: #008b8b;">&lt;-</span> data_unfiltered[data_unfiltered$Running!=<span style="color: #8b2252;">"PracTrials"</span>,]

<span style="color: #b22222;"># </span><span style="color: #b22222;">Assign group names </span>
data$Group[data$Subject &gt; 100 &amp; data$Subject &lt; 200] = <span style="color: #8b2252;">"Monolinguals"</span>
data$Group[data$Subject &gt; 200 &amp; data$Subject &lt; 300] = <span style="color: #8b2252;">"SpanEng_Bilinguals"</span>
data$Group[data$Subject &gt; 300 &amp; data$Subject &lt; 400] = <span style="color: #8b2252;">"ChineseEng_Bilinguals"</span>
data$Group[data$Subject &gt; 400 &amp; data$Subject &lt; 500] = <span style="color: #8b2252;">"EngSpan_Bilinguals"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Remove the participant whose number fall outside of these windows</span>
data = data[is.na(data$Group)==F,]


<span style="color: #b22222;"># </span><span style="color: #b22222;">Preserve Stimulus.ACC as a new variable in data called "original_acc".</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Make Stimulus.ACC a factor, labeling 0s as "incorrect" and 1s as</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">"correct". Also add the relative outliers column.</span>

data$original_acc = data$Stimulus.ACC
data$Stimulus.ACC = as.factor(data$Stimulus.ACC)
levels(data$Stimulus.ACC) = c(<span style="color: #8b2252;">"incorrect"</span>, <span style="color: #8b2252;">"correct"</span>, <span style="color: #8b2252;">"rel_outliers"</span>)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Using ddply(), identify FROM THE CORRECT TRIALS ONLY the trials </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">that fall outside 2.5 standard deviations above and below the mean </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">for each subject. Make sure to only use correct trials in that mean! </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Label these trials as "rel_outliers". Also use a fileorder vector to </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">keep track of the original order othe dataset.</span>

data$FileOrder = seq(1,nrow(data))

data = ddply(data, .(Subject), transform, 
             high_cutoff = mean(Stimulus.RT) + 2.5*sd(Stimulus.RT),
             low_cutoff = mean(Stimulus.RT - 2.5*sd(Stimulus.RT)))

data$Stimulus.ACC[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span> &amp; 
                    (data$Stimulus.RT &gt; data$high_cutoff | 
                       data$Stimulus.RT &lt; data$low_cutoff)]=<span style="color: #8b2252;">"rel_outliers"</span>

data = data[order(data$FileOrder),]

<span style="color: #b22222;"># </span><span style="color: #b22222;">Calculate mean RT and Accuracy (taken from original acc) </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">per Subject, per Group, and per condition (Congruency). For the mean RTs,</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">take only those those trials that were correct. Create a dataframe </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">entitled "summary" that contains this information.</span>

summary = ddply(data[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span>,], .(Subject, Group,
                Congruency), summarise, Mean.RT = mean(Stimulus.RT))

<span style="color: #b22222;"># </span><span style="color: #b22222;">Your advisor also wants to see the data additionally broken down by block. </span>

block_summary = ddply(data[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span>,], 
                .(Subject, Group, Congruency, Running), summarise,
                Mean.RT = mean(Stimulus.RT))
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Modifications to the Simon Script</h3>
<div class="outline-text-3" id="text-1-2">


</div>
