Day5_commented.org
*** Marking absolute outliers & Relative Outliers
We started off by marking relative outliers, those trials which lie
outside of 2.5 SD above and below each participant's mean. We
typically also remove outliers that fall below 200ms (because such a
fast response in a language experiment is likely due to an
anticipatory button press) and above a certain threshold that might
indicate that the subject was not paying attention (e.g., 2000 ms).

First, we should establish the high and low cutoff. This should be
done near the beginning of the script after loading libraries. This
allows people reading your code to see that you've established some
constant values that you will use later on.

#+begin_src R
absolute_outlier_high_cut = 2000
absolute_outlier_low_cut = 200
#+end_src

Next, we now will add an additional level to the accuracy column of
your dataset. This allows you to keep track of the number of relative
and absolute outliers independently. We'll change out level-naming line to the following.

#+begin_src R
levels(data$Stimulus.ACC) = c("incorrect", "correct", "ab_outliers", "rel_outliers")
#+end_src

Now we actually mark absolute outlier trials. We typically do this
directly before marking relative outliers. Compared to marking
relative outliers, marking absolute outliers is easy, because you're
using two static cutoffs, so no plying is necessary.

#+begin_src R
##Identify absolute outliers before relative outliers.
data$Stimulus.ACC[data$Stimulus.RT > absolute_outlier_high_cut |
data$Stimulus.RT < absolute_outlier_low_cut] = "ab_outliers"
#+end_src

Alright, so now we have a set of correct trials, incorrect trials, and
abs_outlier trials. Next we'll calculate the relative outlier trials
with a couple of tiny changes over last time. Before, we calculated
relative outliers only by subject. However, this means that both
correct trials and incorrect trials are included in this
analysis. Because incorrect trials tend to be slower and because we're
often not concerned about RTs for incorrect trials, we should leave
them out of the relative outlier calculation. Additionally, we'll want
to leave out any trials that we've just marked as absolute outliers.
To do this, we can have =ddply()= split our data by subject and
additionally by accuracy type (correct, incorrect, abs_outlier,
rel_outlier) when performing the transform operation.

We'll change out relative outlier detection accordingly to the code below.

#+begin_src R
# Maintain the original file order
data$FileOrder = seq(1,nrow(data))

# Calculate relative outliers by Subject and by ACC
data = ddply(data, .(Subject, Stimulus.ACC), transform, 
             high_cutoff = mean(Stimulus.RT) + 2.5*sd(Stimulus.RT),
             low_cutoff = mean(Stimulus.RT - 2.5*sd(Stimulus.RT)))

# Correct trials that are outside of the cutoffs defined above will be marked as 
# relatively outlying.

data$Stimulus.ACC[data$Stimulus.ACC=="correct" & 
                    (data$Stimulus.RT > data$high_cutoff | 
                       data$Stimulus.RT < data$low_cutoff)]="rel_outliers"

# Reorder the dataset as it originally was.
data = data[order(data$FileOrder),]
#+end_src

*** Summarizing our Simon Data
Now that we have marked outliers, two options exist to summarize the
data depending on how you want the output to look: =plyr= and
=reshape=.

**** =ddply()=
We can ply our data to get mean RTs by subject, by group, by
condition.
#+begin_src R
summary = ddply(data[data$Stimulus.ACC=="correct",], 
.(Subject, Group, Congruency), summarise,
Mean.RT = mean(Stimulus.RT))

summary
#+end_src

With =plyr=, it's relatively easy to go back and re-aggregate your data
by additional factors. For example, if we want to split our data by
block in the experiment, it's as easy as adding the blocking column to
our =ddply()= call.
#+begin_src R
block_summary = ddply(data[data$Stimulus.ACC=="correct",], 
.(Subject, Group, Congruency, Running), summarise,
Mean.RT = mean(Stimulus.RT))

block_summary
#+end_src

