Day5_commented.html

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Marking absolute outliers &amp; Relative Outliers</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>We started off by marking relative outliers, those trials which lie
outside of 2.5 SD above and below each participant's mean. We
typically also remove outliers that fall below 200ms (because such a
fast response in a language experiment is likely due to an
anticipatory button press) and above a certain threshold that might
indicate that the subject was not paying attention (e.g., 2000 ms).
</p>
<p>
First, we should establish the high and low cutoff. This should be
done near the beginning of the script after loading libraries. This
allows people reading your code to see that you've established some
constant values that you will use later on.
</p>



<pre class="src src-R">absolute_outlier_high_cut = 2000
absolute_outlier_low_cut = 200
</pre>


<p>
Next, we now will add an additional level to the accuracy column of
your dataset. This allows you to keep track of the number of relative
and absolute outliers independently. We'll change out level-naming line to the following.
</p>



<pre class="src src-R">levels(data$Stimulus.ACC) = c(<span style="color: #8b2252;">"incorrect"</span>, <span style="color: #8b2252;">"correct"</span>, <span style="color: #8b2252;">"ab_outliers"</span>, <span style="color: #8b2252;">"rel_outliers"</span>)
</pre>


<p>
Now we actually mark absolute outlier trials. We typically do this
directly before marking relative outliers. Compared to marking
relative outliers, marking absolute outliers is easy, because you're
using two static cutoffs, so no plying is necessary.
</p>



<pre class="src src-R"><span style="color: #b22222;">##</span><span style="color: #b22222;">Identify absolute outliers before relative outliers.</span>
data$Stimulus.ACC[data$Stimulus.RT &gt; absolute_outlier_high_cut |
data$Stimulus.RT &lt; absolute_outlier_low_cut] = <span style="color: #8b2252;">"ab_outliers"</span>
</pre>


<p>
Alright, so now we have a set of correct trials, incorrect trials, and
abs<sub>outlier</sub> trials. Next we'll calculate the relative outlier trials
with a couple of tiny changes over last time. Before, we calculated
relative outliers only by subject. However, this means that both
correct trials and incorrect trials are included in this
analysis. Because incorrect trials tend to be slower and because we're
often not concerned about RTs for incorrect trials, we should leave
them out of the relative outlier calculation. Additionally, we'll want
to leave out any trials that we've just marked as absolute outliers.
To do this, we can have <code>ddply()</code> split our data by subject and
additionally by accuracy type (correct, incorrect, abs<sub>outlier</sub>,
rel<sub>outlier</sub>) when performing the transform operation.
</p>
<p>
We'll change out relative outlier detection accordingly to the code below.
</p>



<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintain the original file order</span>
data$FileOrder = seq(1,nrow(data))

<span style="color: #b22222;"># </span><span style="color: #b22222;">Calculate relative outliers by Subject and by ACC</span>
data = ddply(data, .(Subject, Stimulus.ACC), transform, 
             high_cutoff = mean(Stimulus.RT) + 2.5*sd(Stimulus.RT),
             low_cutoff = mean(Stimulus.RT - 2.5*sd(Stimulus.RT)))

<span style="color: #b22222;"># </span><span style="color: #b22222;">Correct trials that are outside of the cutoffs defined above will be marked as </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">relatively outlying.</span>

data$Stimulus.ACC[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span> &amp; 
                    (data$Stimulus.RT &gt; data$high_cutoff | 
                       data$Stimulus.RT &lt; data$low_cutoff)]=<span style="color: #8b2252;">"rel_outliers"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Reorder the dataset as it originally was.</span>
data = data[order(data$FileOrder),]
</pre>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Summarizing our Simon Data</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>Now that we have marked outliers, two options exist to summarize the
data depending on how you want the output to look: <code>plyr</code> and
<code>reshape</code>.
</p>
<ul>
<li id="sec-1-2-2-1"><code>ddply()</code><br/>
We can ply our data to get mean RTs by subject, by group, by
condition.



<pre class="src src-R">summary = ddply(data[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span>,], 
.(Subject, Group, Congruency), summarise,
Mean.RT = mean(Stimulus.RT))

summary
</pre>


<p>
With <code>plyr</code>, it's relatively easy to go back and re-aggregate your data
by additional factors. For example, if we want to split our data by
block in the experiment, it's as easy as adding the blocking column to
our <code>ddply()</code> call.
</p>


<pre class="src src-R">block_summary = ddply(data[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span>,], 
.(Subject, Group, Congruency, Running), summarise,
Mean.RT = mean(Stimulus.RT))

block_summary
</pre>


</li>
</ul>
<ul>
