Day5_commented.org
**** =melt()= and =cast()= from the =reshape= package
The reshape package is great for getting your data to look just the
way you need it for various analyses. In addition to reshaping, it can
and will perform an aggregation function (e.g., mean) if
necessary. Reshape has two main functions, =melt()= and =cast()=. Melt
creates a "molten" data.frame. =cast()= takes a molten data.frame and
reshapes it to your specification.

When melting your data, =melt()= needs to know two things, first what
dataset you're melting. Second it needs to know either what your
measure variables of interest are (=measure.vars= ) or what your
identification variables are (=id.vars=). Measure variables are
typically those that you're planning to aggregate (i.e., dependent
variables). ID variables are essentially anything else. Typically it's
easiest to specify whichever variables you have the least of, because
=melt()= will assume that whatever is not specified will belong to the
other set of variables. For example, if you specify one measure
variable, everything else will be considered ID variables.

For our Simon data, let's specify just the one measure variable of
interest, RT. We can do separate melts for summary and for block
summary.
#+begin_src R
summary_melt <- melt(summary,  #we're going to melt down summary
                     measure.vars="Mean.RT") #our measure var is mean RT

blocksummary_melt <- melt(block_summary, measure.vars="Mean.RT")
#+end_src

Now let's cast our melted data. =cast()= expects three
arguments. First, it needs to know the name of the melted
dataset. Next, it wants to know how to reshape your data. Finally, it
needs an aggregation function (e.g., mean).

The reshape equation consists of two parts separated by ~. On the left side are,
generally, variables or factors that you want specified in each row of
a column. These are typically between-subjects factors if you're
thinking in the format of repeated measures ANOVA. For example, each
subject you may want listed on a separate row of a subject
column. Also, each subject belongs to only one group. Thus, subject
and group should fall to the left side of the equation. 

On the right side of the equation, you want to list factors or
variables which will be separated into measure columns. In the context
of repeated measures ANOVA, these are typically within subject
variables. So for the Simon data, we want each condition of the
congruency factor to be included in a column.  

Finally, you should specify some aggregation function, such as
mean. If you do not, =cast()= will just count the number of cells.

#+begin_src R
summary_recasted <- cast(summary_melt, #melted data to recast
                         Subject + Group ~ Congruency, mean) #the formula then the aggregation
#+end_src

Let's say we also wanted to include block of the experiment in this
analysis as well. Each subject saw every block, so it's a repeated
factor and hence can be added to the right side of the cast equation.
#+begin_src R
blocksummary_recasted <- cast(blocksummary_melt, 
                              Subject+Group~Congruency+Running,mean)
#+end_src

Now the really cool thing about melt/cast is that they can function on
your trial-level data and figure out the aggregation for you. So if
you're planning on aggregating and reshaping your data, =ddply()= is not
really necessary.

#+begin_src R
#Melt our correct data with measure a variable of =Stimulus.RT=
data.melted <- melt(data[data$Stimulus.ACC=="correct",],
     measure.vars="Stimulus.RT")

data.casted <- cast(data.melted,
                         Subject + Group ~ Congruency, mean) #the formula then the aggregation
#+end_src

Really easy right? It's also easy to include additional factors
here. Because we're working with melted trial level data, we don't
even have to re-melt anything like we did for the summary datasets. We
just add any factor to the equation in the appropriate place.

#+begin_src R
data.casted <- cast(data.melted,
                         Subject + Group ~ Running+ Congruency, mean) #the formula then the aggregation
#+end_src

