Day5_commented.html
<li id="sec-1-2-2-2"><code>melt()</code> and <code>cast()</code> from the <code>reshape</code> package<br/>
The reshape package is great for getting your data to look just the
way you need it for various analyses. In addition to reshaping, it can
and will perform an aggregation function (e.g., mean) if
necessary. Reshape has two main functions, <code>melt()</code> and <code>cast()</code>. Melt
creates a "molten" data.frame. <code>cast()</code> takes a molten data.frame and
reshapes it to your specification.

<p>
When melting your data, <code>melt()</code> needs to know two things, first what
dataset you're melting. Second it needs to know either what your
measure variables of interest are (<code>measure.vars</code> ) or what your
identification variables are (<code>id.vars</code>). Measure variables are
typically those that you're planning to aggregate (i.e., dependent
variables). ID variables are essentially anything else. Typically it's
easiest to specify whichever variables you have the least of, because
<code>melt()</code> will assume that whatever is not specified will belong to the
other set of variables. For example, if you specify one measure
variable, everything else will be considered ID variables.
</p>
<p>
For our Simon data, let's specify just the one measure variable of
interest, RT. We can do separate melts for summary and for block
summary.
</p>


<pre class="src src-R">summary_melt <span style="color: #008b8b;">&lt;-</span> melt(summary,  <span style="color: #b22222;">#</span><span style="color: #b22222;">we're going to melt down summary</span>
                     measure.vars=<span style="color: #8b2252;">"Mean.RT"</span>) <span style="color: #b22222;">#</span><span style="color: #b22222;">our measure var is mean RT</span>

blocksummary_melt <span style="color: #008b8b;">&lt;-</span> melt(block_summary, measure.vars=<span style="color: #8b2252;">"Mean.RT"</span>)
</pre>


<p>
Now let's cast our melted data. <code>cast()</code> expects three
arguments. First, it needs to know the name of the melted
dataset. Next, it wants to know how to reshape your data. Finally, it
needs an aggregation function (e.g., mean).
</p>
<p>
The reshape equation consists of two parts separated by ~. On the left side are,
generally, variables or factors that you want specified in each row of
a column. These are typically between-subjects factors if you're
thinking in the format of repeated measures ANOVA. For example, each
subject you may want listed on a separate row of a subject
column. Also, each subject belongs to only one group. Thus, subject
and group should fall to the left side of the equation. 
</p>
<p>
On the right side of the equation, you want to list factors or
variables which will be separated into measure columns. In the context
of repeated measures ANOVA, these are typically within subject
variables. So for the Simon data, we want each condition of the
congruency factor to be included in a column.  
</p>
<p>
Finally, you should specify some aggregation function, such as
mean. If you do not, <code>cast()</code> will just count the number of cells.
</p>



<pre class="src src-R">summary_recasted <span style="color: #008b8b;">&lt;-</span> cast(summary_melt, <span style="color: #b22222;">#</span><span style="color: #b22222;">melted data to recast</span>
                         Subject + Group ~ Congruency, mean) <span style="color: #b22222;">#</span><span style="color: #b22222;">the formula then the aggregation</span>
</pre>


<p>
Let's say we also wanted to include block of the experiment in this
analysis as well. Each subject saw every block, so it's a repeated
factor and hence can be added to the right side of the cast equation.
</p>


<pre class="src src-R">blocksummary_recasted <span style="color: #008b8b;">&lt;-</span> cast(blocksummary_melt, 
                              Subject+Group~Congruency+Running,mean)
</pre>


<p>
Now the really cool thing about melt/cast is that they can function on
your trial-level data and figure out the aggregation for you. So if
you're planning on aggregating and reshaping your data, <code>ddply()</code> is not
really necessary.
</p>



<pre class="src src-R"><span style="color: #b22222;">#</span><span style="color: #b22222;">Melt our correct data with measure a variable of =Stimulus.RT=</span>
data.melted <span style="color: #008b8b;">&lt;-</span> melt(data[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span>,],
     measure.vars=<span style="color: #8b2252;">"Stimulus.RT"</span>)

data.casted <span style="color: #008b8b;">&lt;-</span> cast(data.melted,
                         Subject + Group ~ Congruency, mean) <span style="color: #b22222;">#</span><span style="color: #b22222;">the formula then the aggregation</span>
</pre>


<p>
Really easy right? It's also easy to include additional factors
here. Because we're working with melted trial level data, we don't
even have to re-melt anything like we did for the summary datasets. We
just add any factor to the equation in the appropriate place.
</p>



<pre class="src src-R">data.casted <span style="color: #008b8b;">&lt;-</span> cast(data.melted,
                         Subject + Group ~ Running+ Congruency, mean) <span style="color: #b22222;">#</span><span style="color: #b22222;">the formula then the aggregation</span>
</pre>


</li>
</ul>
</div>
</div>
</div>

</div>
