Day5_commented.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Final Script</h2>
<div class="outline-text-2" id="text-2">


<p>
<a href="./Script Files/day5_script.R">Link to final R script file</a>n
</p>
<p>
Final Script printed here:
</p>


<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Load packages</span>
<span style="color: #008b8b;">library</span>(plyr)
<span style="color: #008b8b;">library</span>(reshape)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Constants for outlier detection</span>
absolute_outlier_high_cut = 2000
absolute_outlier_low_cut = 200

<span style="color: #b22222;"># </span><span style="color: #b22222;">Load Data</span>
data_unfiltered <span style="color: #008b8b;">&lt;-</span> read.csv(<span style="color: #8b2252;">"Cari_Simon_Data.csv"</span>)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Remove practice</span>
data <span style="color: #008b8b;">&lt;-</span> data_unfiltered[data_unfiltered$Running!=<span style="color: #8b2252;">"PracTrials"</span>,]

<span style="color: #b22222;"># </span><span style="color: #b22222;">Assign group names </span>
data$Group[data$Subject &gt; 100 &amp; data$Subject &lt; 200] = <span style="color: #8b2252;">"Monolinguals"</span>
data$Group[data$Subject &gt; 200 &amp; data$Subject &lt; 300] = <span style="color: #8b2252;">"SpanEng_Bilinguals"</span>
data$Group[data$Subject &gt; 300 &amp; data$Subject &lt; 400] = <span style="color: #8b2252;">"ChineseEng_Bilinguals"</span>
data$Group[data$Subject &gt; 400 &amp; data$Subject &lt; 500] = <span style="color: #8b2252;">"EngSpan_Bilinguals"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Remove the participant whose number fall outside of these windows</span>
data = data[is.na(data$Group)==F,]


<span style="color: #b22222;"># </span><span style="color: #b22222;">Preserve Stimulus.ACC as a new variable in data called "original_acc".</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Make Stimulus.ACC a factor, labeling 0s as "incorrect" and 1s as</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">"correct". Also add the relative outliers column.</span>

data$original_acc = data$Stimulus.ACC
data$Stimulus.ACC = as.factor(data$Stimulus.ACC)
levels(data$Stimulus.ACC) = c(<span style="color: #8b2252;">"incorrect"</span>, <span style="color: #8b2252;">"correct"</span>, <span style="color: #8b2252;">"ab_outliers"</span>, <span style="color: #8b2252;">"rel_outliers"</span>)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Identify absolute outliers before relative outliers.</span>
data$Stimulus.ACC[data$Stimulus.RT &gt; absolute_outlier_high_cut |
data$Stimulus.RT &lt; absolute_outlier_low_cut] = <span style="color: #8b2252;">"ab_outliers"</span>


<span style="color: #b22222;"># </span><span style="color: #b22222;">Using ddply(), identify FROM THE CORRECT TRIALS ONLY the trials </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">that fall outside 2.5 standard deviations above and below the mean </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">for each subject. Make sure to only use correct trials in that mean! </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Label these trials as "rel_outliers". Also use a fileorder vector to </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">keep track of the original order othe dataset.</span>

data$FileOrder = seq(1,nrow(data))

data = ddply(data, .(Subject, Stimulus.ACC), transform, 
             high_cutoff = mean(Stimulus.RT) + 2.5*sd(Stimulus.RT),
             low_cutoff = mean(Stimulus.RT - 2.5*sd(Stimulus.RT)))

data$Stimulus.ACC[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span> &amp; 
                    (data$Stimulus.RT &gt; data$high_cutoff | 
                       data$Stimulus.RT &lt; data$low_cutoff)]=<span style="color: #8b2252;">"rel_outliers"</span>

data = data[order(data$FileOrder),]

<span style="color: #b22222;"># </span><span style="color: #b22222;">Calculate mean RT and Accuracy (taken from original acc) </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">per Subject, per Group, and per condition (Congruency). For the mean RTs,</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">take only those those trials that were correct. Create a dataframe </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">entitled "summary" that contains this information.</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Using plyr</span>

summary = ddply(data[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span>,], 
                 .(Subject, Group, Congruency), summarise,
                 Mean.RT = mean(Stimulus.RT))

block_summary = ddply(data[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span>,], 
                      .(Subject, Group, Congruency, Running), summarise,
                      Mean.RT = mean(Stimulus.RT))


<span style="color: #b22222;"># </span><span style="color: #b22222;">Reshaping the summary frame</span>
summary_melt <span style="color: #008b8b;">&lt;-</span> melt(summary,  <span style="color: #b22222;">#</span><span style="color: #b22222;">we're going to melt down summary</span>
                     measure.vars=<span style="color: #8b2252;">"Mean.RT"</span>) <span style="color: #b22222;">#</span><span style="color: #b22222;">our measure var is mean RT</span>

blocksummary_melt <span style="color: #008b8b;">&lt;-</span> melt(block_summary, measure.vars=<span style="color: #8b2252;">"Mean.RT"</span>)

summary_recasted <span style="color: #008b8b;">&lt;-</span> cast(summary_melt, <span style="color: #b22222;">#</span><span style="color: #b22222;">melted data to recast</span>
                         Subject + Group ~ Congruency, mean) <span style="color: #b22222;">#</span><span style="color: #b22222;">the formula then the aggregation</span>

blocksummary_recasted <span style="color: #008b8b;">&lt;-</span> cast(blocksummary_melt, 
                              Subject+Group~Congruency+Running,mean)


<span style="color: #b22222;"># </span><span style="color: #b22222;">Melting and casting our trial level data without using ddply</span>
data.melted <span style="color: #008b8b;">&lt;-</span> melt(data[data$Stimulus.ACC==<span style="color: #8b2252;">"correct"</span>,],
     measure.vars=<span style="color: #8b2252;">"Stimulus.RT"</span>)

data.casted <span style="color: #008b8b;">&lt;-</span> cast(data.melted,
                         Subject + Group ~ Congruency, mean) <span style="color: #b22222;">#</span><span style="color: #b22222;">the formula then the aggregation</span>

<span style="color: #b22222;">#</span><span style="color: #b22222;">Add block if we want it</span>
data.casted <span style="color: #008b8b;">&lt;-</span> cast(data.melted,
                         Subject + Group ~ Running+ Congruency, mean) <span style="color: #b22222;">#</span><span style="color: #b22222;">the formula then the aggregation</span>
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-05-19 15:12:44 EDT</p>
<p class="author">Author: Cari Bogulski, Jason Gullifer</p>
<p class="creator">Org version 7.8.11 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
